# ViewDesignOptionsConfig Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..ViewDesignOptionsConfig Property
ParameterTypeId Class See Also
---
"Design Option Configuration"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId ViewDesignOptionsConfig { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property ViewDesignOptionsConfig As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ ViewDesignOptionsConfig {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace